app/controllers/fukus_controller.rb

  def index
    @fukus = Fuku.all
---
SELECT "fukus".* FROM "fukus"

  def show
    @fuku = Fuku.find(params[:id])
---
SELECT "fukus".* FROM "fukus" WHERE "fukus"."id" = 1 LIMIT 1

  def create
    @fuku = Fuku.new(fuku_params)
    if @fuku.save
---
INSERT INTO "fukus" ("name", "price", "url", "created_at", "updated_at") VALUES ('1', 1000, 'https://', '2026-09-18 05:28:46.759273', '2026-09-18 05:28:46.759273') RETURNING "id"

  def edit
    @fuku = Fuku.find(params[:id])
---
SELECT "fukus".* FROM "fukus" WHERE "fukus"."id" = 1 LIMIT 1

  def update
    @fuku = Fuku.find(params[:id])
    if @fuku.update(fuku_params)
---
SELECT "fukus".* FROM "fukus" WHERE "fukus"."id" = 1 LIMIT 1
UPDATE "fukus" SET "price" = 1001, "updated_at" = '2026-09-18 05:30:06.836962' WHERE "fukus"."id" = 1

  def destroy
    @fuku = Fuku.find(params[:id])
    @fuku.destroy
---
SELECT "fukus".* FROM "fukus" WHERE "fukus"."id" = 1 LIMIT 1
DELETE FROM "fukus" WHERE "fukus"."id" = 1