app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "fukus"
---
          <p class="sidebar-label">登録中のアイテム</p>
          <p class="summary-count"><%= Fuku.count %><span>点</span></p>